is1200-example-projects/mcb32tools/headers/proc/p32mz1024ecg100.h
#define _WDTCON_WDTCLRKEY8_POSITION              0x00000018
#define _WDTCON_WDTCLRKEY8_MASK                  0x01000000
#define _WDTCON_WDTCLRKEY8_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY9_POSITION              0x00000019
#define _WDTCON_WDTCLRKEY9_MASK                  0x02000000
#define _WDTCON_WDTCLRKEY9_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY10_POSITION             0x0000001A
#define _WDTCON_WDTCLRKEY10_MASK                 0x04000000
#define _WDTCON_WDTCLRKEY10_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY11_POSITION             0x0000001B
#define _WDTCON_WDTCLRKEY11_MASK                 0x08000000
#define _WDTCON_WDTCLRKEY11_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY12_POSITION             0x0000001C
#define _WDTCON_WDTCLRKEY12_MASK                 0x10000000
#define _WDTCON_WDTCLRKEY12_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY13_POSITION             0x0000001D
#define _WDTCON_WDTCLRKEY13_MASK                 0x20000000
#define _WDTCON_WDTCLRKEY13_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY14_POSITION             0x0000001E
#define _WDTCON_WDTCLRKEY14_MASK                 0x40000000
#define _WDTCON_WDTCLRKEY14_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY15_POSITION             0x0000001F
#define _WDTCON_WDTCLRKEY15_MASK                 0x80000000
#define _WDTCON_WDTCLRKEY15_LENGTH               0x00000001

#define _WDTCON_WDTPSTA_POSITION                 0x00000002
#define _WDTCON_WDTPSTA_MASK                     0x0000007C
#define _WDTCON_WDTPSTA_LENGTH                   0x00000005

#define _WDTCON_WDTPS_POSITION                   0x00000002
#define _WDTCON_WDTPS_MASK                       0x0000007C
#define _WDTCON_WDTPS_LENGTH                     0x00000005

#define _WDTCON_w_POSITION                       0x00000000
#define _WDTCON_w_MASK                           0xFFFFFFFF
#define _WDTCON_w_LENGTH                         0x00000020

#define _DMTCON_ON_POSITION                      0x0000000F
#define _DMTCON_ON_MASK                          0x00008000
#define _DMTCON_ON_LENGTH                        0x00000001

#define _DMTPRECLR_STEP1_POSITION                0x00000008
#define _DMTPRECLR_STEP1_MASK                    0x0000FF00
#define _DMTPRECLR_STEP1_LENGTH                  0x00000008

#define _DMTCLR_STEP2_POSITION                   0x00000000
#define _DMTCLR_STEP2_MASK                       0x000000FF
#define _DMTCLR_STEP2_LENGTH                     0x00000008

#define _DMTSTAT_WINOPN_POSITION                 0x00000000
#define _DMTSTAT_WINOPN_MASK                     0x00000001
#define _DMTSTAT_WINOPN_LENGTH                   0x00000001

#define _DMTSTAT_DMTEVENT_POSITION               0x00000005
#define _DMTSTAT_DMTEVENT_MASK                   0x00000020
#define _DMTSTAT_DMTEVENT_LENGTH                 0x00000001

#define _DMTSTAT_BAD_POSITION                    0x00000006
#define _DMTSTAT_BAD_MASK                        0x000000C0
#define _DMTSTAT_BAD_LENGTH                      0x00000002

#define _DMTSTAT_BAD2_POSITION                   0x00000006
#define _DMTSTAT_BAD2_MASK                       0x00000040
#define _DMTSTAT_BAD2_LENGTH                     0x00000001

#define _DMTSTAT_BAD1_POSITION                   0x00000007
#define _DMTSTAT_BAD1_MASK                       0x00000080
#define _DMTSTAT_BAD1_LENGTH                     0x00000001

#define _DMTSTAT_w_POSITION                      0x00000000
#define _DMTSTAT_w_MASK                          0xFFFFFFFF
#define _DMTSTAT_w_LENGTH                        0x00000020

#define _DMTCNT_COUNTER_POSITION                 0x00000000
#define _DMTCNT_COUNTER_MASK                     0xFFFFFFFF
#define _DMTCNT_COUNTER_LENGTH                   0x00000020

#define _DMTPSCNT_PSCNT_POSITION                 0x00000000
#define _DMTPSCNT_PSCNT_MASK                     0xFFFFFFFF
#define _DMTPSCNT_PSCNT_LENGTH                   0x00000020

#define _DMTPSINTV_PSINTV_POSITION               0x00000000
#define _DMTPSINTV_PSINTV_MASK                   0xFFFFFFFF
#define _DMTPSINTV_PSINTV_LENGTH                 0x00000020

#define _RTCCON_RTCOE_POSITION                   0x00000000
#define _RTCCON_RTCOE_MASK                       0x00000001
#define _RTCCON_RTCOE_LENGTH                     0x00000001

#define _RTCCON_HALFSEC_POSITION                 0x00000001
#define _RTCCON_HALFSEC_MASK                     0x00000002
#define _RTCCON_HALFSEC_LENGTH                   0x00000001

#define _RTCCON_RTCSYNC_POSITION                 0x00000002
#define _RTCCON_RTCSYNC_MASK                     0x00000004
#define _RTCCON_RTCSYNC_LENGTH                   0x00000001

#define _RTCCON_RTCWREN_POSITION                 0x00000003
#define _RTCCON_RTCWREN_MASK                     0x00000008
#define _RTCCON_RTCWREN_LENGTH                   0x00000001

#define _RTCCON_RTCCLKON_POSITION                0x00000005
#define _RTCCON_RTCCLKON_MASK                    0x00000020
#define _RTCCON_RTCCLKON_LENGTH                  0x00000001

#define _RTCCON_RTCOUTSEL_POSITION               0x00000006
#define _RTCCON_RTCOUTSEL_MASK                   0x000000C0
#define _RTCCON_RTCOUTSEL_LENGTH                 0x00000002

#define _RTCCON_RTCCLKSEL_POSITION               0x00000008
#define _RTCCON_RTCCLKSEL_MASK                   0x00000300
#define _RTCCON_RTCCLKSEL_LENGTH                 0x00000002

#define _RTCCON_SIDL_POSITION                    0x0000000D
#define _RTCCON_SIDL_MASK                        0x00002000
#define _RTCCON_SIDL_LENGTH                      0x00000001

#define _RTCCON_ON_POSITION                      0x0000000F
#define _RTCCON_ON_MASK                          0x00008000
#define _RTCCON_ON_LENGTH                        0x00000001

#define _RTCCON_CAL_POSITION                     0x00000010
#define _RTCCON_CAL_MASK                         0x03FF0000
#define _RTCCON_CAL_LENGTH                       0x0000000A

#define _RTCCON_w_POSITION                       0x00000000
#define _RTCCON_w_MASK                           0xFFFFFFFF
#define _RTCCON_w_LENGTH                         0x00000020

